AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

CommonForms/ВводСтрокиПН/Ext/Form/Module.bsl
#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Валюта 		= Параметры.Валюта;
	Количество 	= Параметры.Количество;
	Цена 		= Параметры.Цена;
	Фирма 		= Параметры.Фирма;
	Номенклатура = Параметры.Номенклатура;
	
	ЭтаФорма.Заголовок = гоИмя(Номенклатура, Ложь);
	
	Контрагент 	= ?(Параметры.Свойство("Контрагент"), Параметры.Контрагент, 0);
	Склад 		= ?(Параметры.Свойство("Склад"), Параметры.Склад, 0);
	
	стрОстаток 	= "";
	стрЦена 	= "";
	
	//Начало 12.01.2018 18:42:20
	ДокументОснование = Параметры.Док;
	//Конец
	
	Если гоНПЗ(Номенклатура) И гоНПЗ(Склад) Тогда
		стрОстаток = гоИмя(Склад) + НСтр("ru = ': ост. номенклатуры = '; en = ': rest of good = '") + омСервер.ОстатокНоменклатуры(Фирма, Склад, Номенклатура);
	КонецЕсли; 
	
	Элементы.Количество.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковКоличество;
	Элементы.Цена.ФорматРедактирования = "ЧДЦ=" + Фирма.ЧислоЗнаковЦенаЗакупки;
	
	ПоСериям = Номенклатура.УчетПоСериям;
	Элементы.ГрТабл.Видимость = ПоСериям;
	Элементы.Количество.ТолькоПросмотр = ПоСериям;
	
	//2016.03.25
	//Элементы.РучнойШК.Видимость = гоПользователь().КлавиатурныйСканерШК; *****************************************************************************
	ЭтаФорма.КлючСохраненияПоложенияОкна = "ВводСтрокиПН." + ?(ПоСериям, "ПоСериям", "БезСерий"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаботаСоСканеромШК.СканерШКПодключить();
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
//2016.03.25
//чтобы предупредить о выходе по ЕСК, когда есть данные

	Если (Табл.Количество() > 0) И (НЕ МойВыход) Тогда 
		Отказ = Истина;
		клНетДа(Новый ОписаниеОповещения("ПередЗакрытиемПослеПодтверждения", ЭтотОбъект), НСтр("ru = 'Закрыть окно? Сканировать придется заново!'; en = 'Close this window? You will have to scan again!'"));
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПослеПодтверждения(Результат, ДопПараметры) Экспорт
	Если Результат Тогда Возврат КонецЕсли; 
	МойВыход = Истина;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	//2016.02.08
	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда Возврат КонецЕсли; 
	
	Если ЭтаФорма.ТекущийЭлемент = Элементы.Цена Тогда ЭтаФорма.ТекущийЭлемент = Элементы.Табл КонецЕсли; 
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда  
		ЛюбаяСерия(ШК);
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура СохранитьЗакрыть(Команда)
	//2016.01.30
	//разрешаем нулевую цену
	//Если Цена = 0 Тогда клОшибка("Не введена цена закупки!"); Возврат; КонецЕсли;
	
	Серии = "";
	Для Каждого _Табл Из Табл Цикл
		гоРез(Серии, _Табл.Серия, гоРС());
	КонецЦикла;
	
	//2017.02.05
	ПоследниеСерии = Серии;
	
	Пар = Новый Структура;
	Пар.Вставить("Количество", Количество);
	Пар.Вставить("Цена", Цена);
	Пар.Вставить("Серии", Серии);
	
	//2016.03.25
	//чтобы предупредить о выходе по ЕСК, когда есть данные
	МойВыход = Истина;
	
	ОповеститьОВыборе(Пар);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСерию(Команда)
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавитьСериюПослеВвода", ЭтотОбъект), НовСер, НСтр("ru = 'Введите значение'; en = 'Enter value'"), 30);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСериюПослеВвода(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат КонецЕсли; 
	НовСер = Результат;
	ЛюбаяСерия(НовСер);
КонецПроцедуры

&НаКлиенте
Процедура ЛюбаяСерия(локНовСер, СтатьНаРучной = Ложь)
//2016.03.25 + СтатьНаРучной = Ложь

	НовСер = СокрЛП(локНовСер);
	Если НовСер = "" Тогда Возврат КонецЕсли;
	
	//Начало 12.01.2018 18:42:20
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		ПроверитьСериюНаПовторнуюЗакупку(НовСер);
	КонецЕсли;
	//Конец
	
	Мас = Табл.НайтиСтроки(Новый Структура("Серия", НовСер));
	Если Мас.Количество() <> 0 Тогда 
		Сигнал(); 
		клОшибка(СтрШаблон("%1: %2 %3", 
							омСервер.Фрмт(НСтр("ru = 'Уже есть в таблице'; en = 'Already in the table'"), "НАДПИСЬ_ЦВ1"), 
							омСервер.Фрмт(НовСер, "НАДПИСЬ_ЦВ2"), 
							омСервер.Фрмт("!", "НАДПИСЬ_ЦВ1"))); 
		Возврат; 
	КонецЕсли;
	
	_Табл = Табл.Добавить();
	_Табл.Серия = НовСер;
	
	Количество = Табл.Количество();
	
	//2016.03.25
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСерию(Команда)
	Если Табл.Количество() = 0 Тогда Возврат КонецЕсли;
	
	Стр = Элементы.Табл.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли;
	
	Попытка
		Сер = Стр.Серия;
	Исключение
	    Возврат;
	КонецПопытки; 
	
	клНетДа(Новый ОписаниеОповещения("УдалитьСериюЗавершение", ЭтотОбъект, Сер), СтрШаблон("%1 %2 ?", НСтр("ru = 'Удалить значение'; en = 'Delete value'"), гоИмя(Сер)));
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСериюЗавершение(Результат, Сер) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Мас = Табл.НайтиСтроки(Новый Структура("Серия", Сер));
	Если Мас.Количество() = 0 Тогда клОшибка("Странно, ничего не найдено!"); Возврат; КонецЕсли;
	
	Табл.Удалить(Мас[0]);
	
	Количество = Табл.Количество();
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
//2016.03.25
	
	ЛюбаяСерия(РучнойШК, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
//2016.03.25
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераИлиФайла(Команда)
//2016.04.07

	//эта штука не всегда работает
	Попытка
		WSHShell = Новый COMОбъект("WScript.Shell");
		WSHShell.SendKeys("^V");
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	Буф = "";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ИзБуфераИлиФайлаПослеВвода", ЭтотОбъект), Буф, НСтр("ru = 'Вставьте (если пусто) серии (CTRL+V) и нажмите ОК'; en = 'Paste (if empty) the series (CTRL+V) and click OK'"), , Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераИлиФайлаПослеВвода(Буф, ДопПараметры) Экспорт
	Если Буф = Неопределено Тогда Возврат КонецЕсли; 
	
	//2016.04.20
	Буф = РаботаСоСканеромШК.ОставитьТолькоИМЕИ(Буф);
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследнийСписок(Команда)
//2017.02.05

	Буф = СокрЛП(ПоследниеСерии);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВосстановитьПоследнийСписокПослеВвода", ЭтотОбъект), Буф, НСтр("ru = 'Если это нужные серии, то нажмите ОК'; en = 'If these are the required series, then click OK'"), , Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоследнийСписокПослеВвода(Буф, ДопПараметры) Экспорт
	Если Буф = Неопределено Тогда Возврат КонецЕсли; 
	
	Буф = РаботаСоСканеромШК.ОставитьТолькоИМЕИ(Буф);
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьСериюНаПовторнуюЗакупку(НомерСерии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ОстаткиТовараОбороты.Регистратор,
	               |	ОстаткиТовараОбороты.Номенклатура,
	               |	ОстаткиТовараОбороты.Партия.Серия КАК Серия,
	               |	ОстаткиТовараОбороты.ОстатокРасход,
	               |	ОстаткиТовараОбороты.Партия.Док.Дата КАК ДатаПрихода
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.Обороты(, , Регистратор, Партия.Серия = &Серия) КАК ОстаткиТовараОбороты
	               |ГДЕ
	               |	ОстаткиТовараОбороты.ОстатокРасход > 0";
	Запрос.УстановитьПараметр("Серия", НомерСерии);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			//Сообщить("Товар с серией " + НомерСерии + " ранее уже был реализован документом " + Выборка.Регистратор + ". Дата прихода: " + Выборка.ДатаПрихода, СтатусСообщения.Информация); 
			Сообщить(СтрШаблон(НСтр("ru = 'Товар с серией %1 ранее уже был реализован документом %2. Дата прихода: %3'; en = 'The good with series %1 was previously sold by document %2. Arrival date: %3'"),
			         НомерСерии, Выборка.Регистратор, Выборка.ДатаПрихода),
					 СтатусСообщения.Информация);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
